package nowcode.PinDuoDuo;

/**
 * Created by n!Ck
 * Date: 2019-03-10
 * Time: 17:37
 * Description:
 *
 * 一个合法的圆括号表达式满足以下条件：
 * 1. "" 空字符串被认为是合法的
 * 2. 如果字符串 "X" 和 "Y" 是合法的，那么字符串 "XY" 也是合法的
 * 3. 如果字符串 "X" 是合法的，那么字符串 "(X)" 也是合法的
 *
 * 例如："" , "()" , "()()" , "(())" 这些都是合法的
 *
 * 现在给出 不保证合法的 两个由圆括号组成的字符串，你需要交错这两个圆括号序列（在组成的新字符串中，每个初始字符串都保持原来的顺序）
 * 得到一个新的合法的圆括号表达式（不同的交错方式可能得到相同的新的表达式，这种情况分开计数），求共有多少种合法的交错方式
 * 如果一种都没有则输出0，输出结果模 10^9+7 的值
 *
 * 输入两行：
 * 分别是两个只有 '(' 和 ')' 组成的字符串，其长度不超过2500
 *
 * 输出一行：
 * 一个数字，为合法的交错方式模上 10^9+7 的值
 *
 * 例如：
 * 输入：
 * (()
 * ())
 *
 * 输出：
 * 19
 */
public class _4 {
}
